
# tap repositories and their packages

tap 'homebrew/core'
brew 'ansible'
brew 'apr'
brew 'apr-util'
brew 'aspell'
brew 'augeas'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'bash-completion'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'boost'
brew 'brotli'
brew 'bsdmake'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'capstone'
brew 'certbot'
brew 'cmake'
brew 'cmigemo'
brew 'colordiff'
brew 'coreutils'
brew 'cscope'
brew 'ctop'
brew 'dark-mode'
brew 'deno'
brew 'dialog'
brew 'digdag'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker-clean'
brew 'double-conversion'
brew 'edencommon'
brew 'eigen'
brew 'elinks'
brew 'exa'
brew 'fasd'
brew 'fb303'
brew 'fbthrift'
brew 'fd'
brew 'fish'
brew 'fizz'
brew 'fmt'
brew 'folly'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'fribidi'
brew 'fx'
brew 'fzf'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'gflags'
brew 'gh'
brew 'ghq'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gradle'
brew 'graphite2'
brew 'grep'
brew 'guile'
brew 'hadolint'
brew 'harfbuzz'
brew 'hexyl'
brew 'htop'
brew 'hub'
brew 'icu4c'
brew 'iproute2mac'
brew 'isl'
brew 'jemalloc'
brew 'jmeter'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jq'
brew 'kompose'
brew 'krb5'
brew 'kubernetes-cli'
brew 'lazygit'
brew 'ldns'
brew 'libcbor'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn2'
brew 'libmpc'
brew 'libnghttp2'
brew 'libpng'
brew 'libpthread-stubs'
brew 'libpython-tabulate'
brew 'libslirp'
brew 'libsodium'
brew 'libspiro'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libuninameslist'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'llvm'
brew 'lua'
brew 'lua@5.1'
brew 'luajit', args: ['HEAD']
brew 'luajit-openresty'
brew 'luarocks'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'make'
brew 'mas'
brew 'maven'
brew 'mcrypt'
brew 'mecab'
brew 'mhash'
brew 'mosh'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'mycli'
brew 'ncurses'
brew 'neovim', args: ['HEAD']
brew 'nettle'
brew 'nghttp2'
brew 'nginx'
brew 'nkf'
brew 'node'
brew 'nodebrew'
brew 'numpy'
brew 'oniguruma'
brew 'openblas'
brew 'openjdk'
brew 'openjdk@11'
brew 'openjdk@17'
brew 'openssl@1.1'
brew 'openvpn'
brew 'p11-kit'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'peco'
brew 'percol'
brew 'perl'
brew 'perl-build'
brew 'pixman'
brew 'pkcs11-helper'
brew 'pkg-config'
brew 'postgresql@14'
brew 'protobuf'
brew 'pyenv'
brew 'pyenv-pip-migrate'
brew 'pyenv-virtualenv'
brew 'pygments'
brew 'python-tabulate'
brew 'python@3.10'
brew 'python@3.8'
brew 'pyyaml'
brew 'qemu'
brew 'rainbarf'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'redpen'
brew 'rename'
brew 'ripgrep'
brew 'ruby'
brew 'ruby-build'
brew 'rust'
brew 'rust-analyzer'
brew 's3cmd'
brew 'sbt'
brew 'scala'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'six'
brew 'snappy'
brew 'sqlite'
brew 'subversion'
brew 'swig'
brew 'tcl-tk'
brew 'telnet'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tomcat'
brew 'tree'
brew 'tree-sitter'
brew 'trivy'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'vault'
brew 'vde'
brew 'wangle'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'woff2'
brew 'xmlto'
brew 'xorgproto'
brew 'xz'
brew 'z'
brew 'z3'
brew 'zlib'
brew 'zplug'
brew 'zsh'
brew 'zsh-completions'
brew 'zstd'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-powerline-symbols'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'

tap 'homebrew/cask-versions'
cask 'adoptopenjdk8'
cask 'sequel-pro-nightly'
cask 'slack-beta'
cask 'zulu8'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'adoptopenjdk'
cask 'alacritty'
cask 'alfred'
cask 'android-studio'
cask 'appcleaner'
cask 'authy'
cask 'bartender'
cask 'bathyscaphe'
cask 'bitbar'
cask 'caffeine'
cask 'chatwork'
cask 'choosy'
cask 'cyberduck'
cask 'deckset'
cask 'devutils'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'flipper'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'hyper'
cask 'hyperswitch'
cask 'imageoptim'
cask 'insomnia'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepassx'
cask 'kindle'
cask 'lastfm'
cask 'licecap'
cask 'quitter'
cask 'react-native-debugger'
cask 'reactotron'
cask 'scroll-reverser'
cask 'sketch'
cask 'skitch'
cask 'spotify'
cask 'tableplus'
cask 'teamviewer'
cask 'timemachineeditor'
cask 'tradingview'
cask 'tunnelbear'
cask 'vagrant'
cask 'versions'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
cask 'wireshark'
cask 'workplace-chat'
cask 'xquartz'
cask 'zoom'

tap 'adoptopenjdk/openjdk'

tap 'aquasecurity/trivy'

tap 'argon/mas'

tap 'aws/tap'
brew 'aws-sam-cli'
brew 'copilot-cli'

tap 'buo/cask-upgrade'

tap 'github/gh'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'kyoshidajp/ghkw'
brew 'ghkw'

tap 'neovim/neovim'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'remind101/formulae'
brew 'assume-role'

tap 'sanemat/font'
brew 'ricty', args: ['with-powerline']

tap 'vectordotdev/brew'
brew 'vector'

# App Store applications
mas 'Apple Configurator (2.15.1)', id: 1037126344
mas 'BetterSnapTool (1.9.8)', id: 417375580
mas 'CommentScreen (1.1.4)', id: 1450950860
mas 'CotEditor (4.4.0)', id: 1024640650
mas 'DaisyDisk (4.23.1)', id: 411643860
mas 'Darkroom (6.1.1)', id: 953286746
mas 'Developer (10.1.3)', id: 640199958
mas 'Fantastical (3.7.2)', id: 975937182
mas 'GarageBand (10.4.5)', id: 682658836
mas 'Howler Timer (1.6.1)', id: 428846772
mas 'ImageOptim (1.5.0)', id: 1450716465
mas 'iMovie (10.3.1)', id: 408981434
mas 'Keynote (11.2)', id: 409183694
mas 'LINE (7.12.1)', id: 539883307
mas 'MagicCopy (3.0.2)', id: 1434526691
mas 'MARKETSPEED (3.0.0)', id: 946680495
mas 'MeetingBar (4.1.0)', id: 1532419400
mas 'MenubarX (1.5.3)', id: 1575588022
mas 'Monosnap (5.1.7)', id: 540348655
mas 'Numbers (11.2)', id: 409203825
mas 'Pages (11.2)', id: 409201541
mas 'Reeder (5.3.2)', id: 1529448980
mas 'TestFlight (3.2.2)', id: 899247664
mas 'Tweetbot (2.5.8)', id: 557168941
mas 'Twitter (9.30)', id: 1482454543
mas 'VOX (3.5.2)', id: 461369673
mas 'WinArchiver Lite (2.5.3)', id: 414855915
mas 'Xcode (14.0.1)', id: 497799835
mas 'そら案内 (4.5.1)', id: 599799247
