
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'anyenv'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'asdf'
brew 'aspell'
brew 'augeas'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'berkeley-db@5'
brew 'biome'
brew 'boost'
brew 'brotli'
brew 'bsdmake'
brew 'buf'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'capstone'
brew 'clang-format'
brew 'cmake'
brew 'cmigemo'
brew 'colordiff'
brew 'composer'
brew 'coreutils'
brew 'cscope'
brew 'ctop'
brew 'curl'
brew 'dark-mode'
brew 'deno'
brew 'dialog'
brew 'digdag'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker'
brew 'docker-clean'
brew 'docker-completion'
brew 'double-conversion'
brew 'dtc'
brew 'edencommon'
brew 'eigen'
brew 'eza'
brew 'fb303'
brew 'fbthrift'
brew 'fd'
brew 'fish'
brew 'fizz'
brew 'fmt'
brew 'folly'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'fribidi'
brew 'fx'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gflags'
brew 'gh'
brew 'ghq'
brew 'gibo'
brew 'giflib'
brew 'git'
brew 'git-delta'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'go'
brew 'go-task'
brew 'gobject-introspection'
brew 'gradle'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'gts'
brew 'guile'
brew 'hadolint'
brew 'harfbuzz'
brew 'hexyl'
brew 'highway'
brew 'htop'
brew 'hub'
brew 'icu4c'
brew 'imath'
brew 'iproute2mac'
brew 'isl'
brew 'jasper'
brew 'jemalloc'
brew 'jmeter'
brew 'jnv'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'kompose'
brew 'krb5'
brew 'kubernetes-cli'
brew 'lazygit'
brew 'ldns'
brew 'lego'
brew 'libavif'
brew 'libcbor'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgit2@1.7'
brew 'libgpg-error'
brew 'libidn2'
brew 'libmpc'
brew 'libnghttp2'
brew 'libpng'
brew 'libpq'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libslirp'
brew 'libsodium'
brew 'libspiro'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libuninameslist'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvmaf'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'llvm'
brew 'llvm@18'
brew 'lpeg'
brew 'lua'
brew 'luacheck'
brew 'luajit'
brew 'luajit-openresty'
brew 'luarocks'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'make'
brew 'markdownlint-cli'
brew 'marksman'
brew 'mas'
brew 'maven'
brew 'mecab'
brew 'mhash'
brew 'mise'
brew 'mkcert'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'mvfst'
brew 'mysql'
brew 'mysql-client'
brew 'ncurses'
brew 'neovide'
brew 'neovim', args: ['HEAD']
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nginx'
brew 'nkf'
brew 'node'
brew 'oniguruma'
brew 'openblas'
brew 'openexr'
brew 'openfga'
brew 'openjdk'
brew 'openjdk@11'
brew 'openjdk@21'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'openvpn'
brew 'p11-kit'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'peco'
brew 'perl'
brew 'perl-build'
brew 'php'
brew 'pipx'
brew 'pixman'
brew 'pkcs11-helper'
brew 'pkg-config'
brew 'plantuml'
brew 'pnpm'
brew 'postgresql@14'
brew 'prettierd'
brew 'protobuf'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python-packaging'
brew 'python-tabulate'
brew 'python@3.11'
brew 'python@3.12'
brew 'qemu'
brew 'rainbarf'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'redpen'
brew 'rename'
brew 'ripgrep'
brew 'rtmpdump'
brew 'ruby'
brew 'ruby-build'
brew 'ruff'
brew 'rust'
brew 'rust-analyzer'
brew 's3cmd'
brew 'saml2aws'
brew 'sbt'
brew 'scala'
brew 'shared-mime-info'
brew 'sheldon'
brew 'shellcheck'
brew 'shfmt'
brew 'snappy'
brew 'sqlite'
brew 'starship'
brew 'stylua'
brew 'subversion'
brew 'swig'
brew 'tailscale'
brew 'taplo'
brew 'tcl-tk'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tmux'
brew 'tomcat'
brew 'tree'
brew 'tree-sitter'
brew 'treefmt'
brew 'trivy'
brew 'typos-cli'
brew 'unbound'
brew 'unibilium'
brew 'unixodbc'
brew 'usage'
brew 'utf8proc'
brew 'vde'
brew 'vint'
brew 'wangle'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'xmlto'
brew 'xorgproto'
brew 'xz'
brew 'yamllint'
brew 'z'
brew 'z3'
brew 'zlib'
brew 'zoxide'
brew 'zplug'
brew 'zsh'
brew 'zsh-completions'
brew 'zstd'
brew 'zx'

tap 'homebrew/cask'
cask '1password'
cask 'alacritty'
cask 'alfred'
cask 'android-studio'
cask 'ankerwork'
cask 'appcleaner'
cask 'arc'
cask 'asana'
cask 'autodesk-fusion'
cask 'aws-vpn-client'
cask 'bartender'
cask 'bitbar'
cask 'caffeine'
cask 'chatgpt'
cask 'choosy'
cask 'chromium'
cask 'cleanshot'
cask 'cursor'
cask 'cyberduck'
cask 'deckset'
cask 'deepl'
cask 'devtoys'
cask 'devutils'
cask 'discord'
cask 'dropbox'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'flipper'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-powerline-symbols'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'hiddenbar'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepassx'
cask 'keka'
cask 'lastfm'
cask 'licecap'
cask 'lm-studio'
cask 'mimestream'
cask 'monitorcontrol'
cask 'neovide'
cask 'notion'
cask 'notion-calendar'
cask 'ollama'
cask 'orbstack'
cask 'postman'
cask 'prisma-studio'
cask 'quitter'
cask 'raycast'
cask 'react-native-debugger'
cask 'reactotron'
cask 'scroll-reverser'
cask 'sketch'
cask 'slack@beta'
cask 'spotify'
cask 'tableplus'
cask 'teamviewer'
cask 'timemachineeditor'
cask 'tradingview'
cask 'tunnelbear'
cask 'vagrant'
cask 'versions'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vivaldi@snapshot'
cask 'warp'
cask 'webex'
cask 'wezterm@nightly'
cask 'wireshark'
cask 'xbar'
cask 'xquartz'
cask 'zoom'
cask 'zulu@8'

tap 'homebrew/bundle'

tap 'homebrew/services'

tap 'aquasecurity/trivy'

tap 'argon/mas'

tap 'aws/tap'
brew 'copilot-cli'

tap 'bufbuild/buf'

tap 'buo/cask-upgrade'

tap 'daipeihust/tap'
brew 'im-select'

tap 'fsouza/prettierd'

tap 'github/gh'

tap 'go-task/tap'

tap 'gofireflyio/aiac'
brew 'aiac'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'jdxcode/tap'

tap 'kyoshidajp/ghkw'
brew 'ghkw'

tap 'neovim/neovim'

tap 'olets/tap'
brew 'zsh-abbr'

tap 'oven-sh/bun'
brew 'bun'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'remind101/formulae'

tap 'sanemat/font'
brew 'ricty', args: ['with-powerline']

tap 'vectordotdev/brew'
brew 'vector'

tap 'ynqa/tap'

# Other Cask applications
cask 'hyperswitch'
cask 'sequel-pro-nightly'
cask 'slack-beta'
cask 'vivaldi-snapshot'
cask 'wezterm-nightly'
cask 'zulu8'

# App Store applications
mas 'Amphetamine (5.3.2)', id: 937984704
mas 'Apple Configurator (2.17)', id: 1037126344
mas 'BetterSnapTool (1.9.12)', id: 417375580
mas 'Bitwarden (2024.9.0)', id: 1352778147
mas 'CommentScreen (1.1.5)', id: 1450950860
mas 'CotEditor (5.0.1)', id: 1024640650
mas 'DaisyDisk (4.30)', id: 411643860
mas 'Darkroom (6.8.5)', id: 953286746
mas 'Developer (10.6)', id: 640199958
mas 'Howler Timer (1.6.3)', id: 428846772
mas 'Keynote (14.2)', id: 409183694
mas 'LadioCast (000013000)', id: 411213048
mas 'LINE (9.3.0)', id: 539883307
mas 'MeetingBar (4.10.0)', id: 1532419400
mas 'Numbers (14.2)', id: 409203825
mas 'Pages (14.2)', id: 409201541
mas 'Reeder (2024.9.3)', id: 6475002485
mas 'Slack (4.40.128)', id: 803453959
mas 'Tailscale (1.74.0)', id: 1475387142
mas 'TestFlight (3.5.2)', id: 899247664
mas 'The Unarchiver (4.3.8)', id: 425424353
mas 'WinArchiver Lite (2.5.3)', id: 414855915
mas 'Xcode (15.4)', id: 497799835
mas 'そら案内 (5.5.0)', id: 599799247
